Repository: pypi-data/pypi-mirror-318
Catalog: packages/pyams-gis/pyams_gis-2.1.3.tar.gz/pyams_gis-2.1.3/src/pyams_gis/locales/*/LC_MESSAGES/pyams_gis.po
Languages: fr

source: Tile layer
fr: Couche de tuiles

source: WMS layer
fr: Couche WMS

source: GeoPortal layer
fr: Couche GéoPortail

source: ESRI features layer
fr: Couche de features ESRI

source: Google Maps layer
fr: Couche Google

source: Manage GIS maps
fr: Gérer les cartes

source: New layer: {}
fr: Nouvelle couche : {}

source: New layer properties
fr: Propriétés de la nouvelle couche

source: Specified layer name already exists!
fr: Le nom indiqué pour la nouvelle couche est déjà utilisé !

source: Layer properties
fr: Propriétés de la couche

source: Layer: {} ({})
fr: Couche : {} ({})

source: Add tile layer...
fr: Couche tuilée...

source: Add WMS layer...
fr: Couche WMS...

source: Add Geoportal layer...
fr: Couche GéoPortail...

source: Add ESRI feature layer...
fr: Couche de features ESRI...

source: Add Google layer...
fr: Couche Google...

source: Default configuration
fr: Configuration par défaut

source: Map manager default configuration
fr: Configuration par défaut du gestionnaire de cartes

source: Default map configuration
fr: Configuration par défaut

source: Maps manager
fr: Gestionnaire de cartes

source: Properties
fr: Propriétés

source: Map manager properties
fr: Propriétés du gestionnaire de cartes

source: Management interface
fr: Interface d'administration

source: map-manager-menu
fr: Gestionnaire de cartes

source: Maps manager layers
fr: Couches cartographiques

source: List of maps layers
fr: Liste des couches cartographiques

source: Layer name
fr: Nom de la couche

source: Layer title
fr: Libellé de la couche

source: Full layer title
fr: Le libellé peut être affiché dans l'outil de sélection des couches

source: Minimum zoom level
fr: Zoom minimum

source: Minimum zoom level at which layer is displayed
fr: Niveau de zoom minimum à partir duquel la couche est affichée

source: Maximum zoom level
fr: Zoom maximum

source: Maximum zoom level at which layer is displayed
fr: Niveau de zoom maximum jusqu'auquel la couchee st affichée

source: Overlay layer?
fr: Couche de superposition

source: Unlike base layers for which a single layer is visible at a given time, overlay layers are used to display multiple information on top a selected base layer
fr: À la différence des couches de base, pour laquelle une seule couche est visible, les couches de superposition sont utilisées pour afficher de l'information supplémentaire par dessus les couches de base, et peuvent être affichées ou masquées en utilisant un sélecteur de couches

source: Layer URL
fr: URL de la couche

source: URL used to get access to JSON data
fr: URL utilisée pour accéder aux données de la couche

source: Layer style
fr: Style de la couche

source: Layer style, provided in Leaflet JSON format
fr: Style de la couche, indiquée au format JSON de Leaflet

source: Layer attribution
fr: Attribution

source: String used by the attribution control
fr: L'attribution permet d'afficher l'origine de la couche

source: Layer bounds
fr: Limites de la couche

source: Geographical bounds into which layer tiles are displayed
fr: Limites géographiques d'affichage de la couche

source: URL template
fr: Modèle d'URL

source: URL template used to get layer tiles (see leaflet.js docs)
fr: Modèle d'URL utilisée pour accéder aux tuiles de la couche (voir la documentation de Leaflet.js)

source: CRS
fr: Système de référence

source: Coordinates reference system to use for map requests; defaults to map request
fr: Système de coordonnées de référence (CRS) utilisé pour les requêtes vers la couche

source: Layers
fr: Couches

source: Comma-separated list of WMS layers to show
fr: Liste des couches WMS à afficher; séparées par des virgules

source: Comma-separated list of WMS styles
fr: Liste des styles WMS, séparés par des virgules

source: Layer format
fr: Format de la couche

source: WMS image format; use 'image/png' for layers with transparency
fr: Format des images WMS ; utiliser le format 'image/png' pour les couches avec transparence

source: Transparent?
fr: Couche transparente

source: If 'yes', the WMS services will return images with transparency
fr: Si 'oui', le service WMS renverra des images avec fond transparent

source: Version of the WMS service to use
fr: Version du service WMS à utiliser

source: Uppercase?
fr: Majuscules

source: If 'yes', WMS request parameters keys will be uppercase
fr: Si 'oui', les paramètres des requêtes WMS seront envoyés en majuscules

source: API key
fr: Clé d'API

source: Key used to access layer data
fr: Clé d'API utilisée pour l'accès au service

source: IGN layer name
fr: Nom de la couche

source: Name of layer in IGN format
fr: Nom de la couche au format IGN

source: URL used to get the feature layer
fr: URL utilisée pour l'accès à la couche

source: Token
fr: Jeton

source: Token used in all service requests
fr: Jeton d'authentification utilisé pour accéder au service

source: Where condition
fr: Condition

source: Optional expression used to filter features
fr: Expression optionnelle utilisée pour filtrer les éléments exposés par la couche

source: Roads map
fr: Routes

source: Satellite
fr: Vue satellite

source: Hybrid
fr: Vue hybride

source: Google API key used to access maps data
fr: Clé d'API Google utilisée pour accéder au service

source: Map type
fr: Type de carte

source: Type of GoogleMaps layer type
fr: Type de carte Google utilisé

source: Coordinates reference system to use for the map
fr: Système de coordonnées de référence utilisé pour afficher la carte

source: Layers list
fr: Liste des couches visibles

source: List of available layers displayed into this map
fr: Liste des couches disponibles à afficher sur la carte

source: Hidden layers list
fr: Liste des couches masquées

source: This list includes layers which are hidden by default, but which can be switched using the layers selector
fr: Ces couches, qu'il s'agisse de couches de base ou de couches de superposition, sont invisibles à l'affichage de la carte, mais elles peuvent être affichées par l'utilisateur en utilisant le sélecteur de couches

source: Adjust bounds to markers layer
fr: Ajuster l'emprise aux marqueurs

source: If 'yes', map area will be automatically adjusted to markers layer(s), if any
fr: Si 'oui', l'emprise de la carte sera ajustée automatiquement aux marqueurs présents sur la carte, s'il y en a !

source: Initial zoom level
fr: Niveau de zoom

source: Zoom level at which to display map, if auto-adjust is disabled or if there is only one marker
fr: Niveau de zoom utilisé pour l'affichage de la carte, lorsque l'ajustement automatique aux marqueurs est désactivé ou lorsqu'il n'y en n'a qu'un seul

source: Initial center
fr: Centre de la carte

source: Initial map location center
fr: Position du centre de la carte ; cette position n'est appliquée que lorsque l'ajustement' automatique est désactivé, ou lorsqu'il n'y a aucun marqueur sur la carte

source: Initial bounds
fr: Limites de la carte

source: Initial map location bounds, if auto-adjust or initial center are disabled
fr: Plutôt que d'indiquer le centre de la carte et le niveau de zoom, vous pouvez indiquer une emprise qui sera prise en compte si l'ajustement autoamtique est désactivé ET si la position initiale n'est pas sélectionnée

source: Attribution control?
fr: Afficher les attributions

source: If 'yes', an attribution control is added to map
fr: Si 'oui', un contrôle d'attribution correspondant aux sources des différentes couches sera affiché

source: Zoom control?
fr: Contrôle du zoom

source: If 'yes', a zoom control is added to map
fr: Si 'oui', un composant permettant de modifier le niveau de zoom de la carte sera affiché

source: Fullscreen control?
fr: Mode plein écran

source: If 'yes', a fullscreen control is added to map
fr: Si 'oui', un composant permettant de mettre la carte en plein écran sera affiché

source: Layers control?
fr: Sélecteur de couches

source: If 'yes', a layer selection control is added to map
fr: Si 'oui', un composant permettant de sélectionner les couches à afficher sera affiché

source: Keyboard navigation?
fr: Navigation au clavier

source: If 'yes', makes the map focusable and allows users to navigate with keyboard arrows and +/- keys; this option will not be activated on mobile devices
fr: Si 'oui', la carte sera navigable au clavier à l'aide des flèches de navigation et des touches +/- ; cette option n'est pas utilisable sur les périphériques mobiles

source: Scroll wheel zoom?
fr: Zoom à la molette

source: If 'yes', the map can be zoomed using the mouse wheel; this should be avoided to get a good responsive behaviour and handle gestures
fr: Si 'oui', le niveau de zoom de la carte peut être modifié en utilisant la molette de la souris ; il faut noter que cette option est déconseillée pour bien prendre en charge le côté 'responsive' des cartes et la navigation à l'aide des doigts sur les périphériques mobiles

source: Access menu from home
fr: Ajouter un accès depuis l'accueil

source: If 'yes', a menu will be displayed to get access to maps manager from site admin home page
fr: Si 'oui', un menu d'accès au gestionnaire de cartes sera affiché sur la page d'accueil de l'interface d'administration du site

source: Lambert 93 (Metropolitan France)
fr: Lambert 93 (France métropolitaine)

source: Extended Lambert II (Metropolitan France)
fr: Lambert II étendu (France métropolinaine)

source: Projection system
fr: Système de projection

source: You must set longitude and latitude, or None!
fr: Vous devez indiquer la longitude ET la latitude, ou aucun des deux !

source: You can't set coordinates without setting projection!
fr: Vous ne pouvez pas indiquer de coordonnées sans indiquer le système de projection !

source: West limit
fr: Limite ouest

source: South limit
fr: Limite sud

source: East limit
fr: Limite est

source: North limit
fr: Limite nord

source: You must set all coordinates or None!
fr: Vous devez indiquer toutes les coordonnées, ou aucune !

source: Select location from map
fr: Sélection du centre de la carte

source: Clear selected position
fr: Effacer la position sélectionnée

source: Select marker position
fr: Positionner le marqueur de position

source: Select area from map
fr: Sélection de l'emprise de la carte

source: Select map area
fr: Sélection de l'emprise
